In [35]:
import pandas as pd

In [36]:
df = pd.read_csv("day3data.txt")

In [101]:
df2 = pd.DataFrame(columns = ["report"])

In [102]:
df2

Empty DataFrame
Columns: [report]
Index: []

In [103]:
for i in range(len(df)):
    stringed = str(df.loc[i]["report"])
    missing = 12 - len(df.loc[i]["report"])
    if missing > 0:
        toAdd = "0" * missing
        newString = pd.DataFrame({"report": [toAdd + stringed]})
        df2 = df2.append(newString,ignore_index=True)
    else:
        newString = pd.DataFrame({"report": [stringed]})
        df2 = df2.append(newString,ignore_index=True)

In [104]:
df2

           report
0    000011110010
1    010000100100
2    010011111111
3    000101001111
4    010100011111
..            ...
995  011011001000
996  111000101101
997  110100000101
998  011001000001
999  001011000111

[1000 rows x 1 columns]

In [105]:
strLength = len(list(df2.loc[0]["report"]))

In [106]:
out = pd.DataFrame(columns = range(len(df2.loc[0]["report"])), index = range(len(df2)))

In [107]:
df2.loc[0]["report"]

'000011110010'

In [108]:
for i in range(len(df2)):
    a = df2.loc[i]["report"]
    split = list(a)
    out.iloc[i] = split

In [109]:
out

     0  1  2  3  4  5  6  7  8  9 10 11
0    0  0  0  0  1  1  1  1  0  0  1  0
1    0  1  0  0  0  0  1  0  0  1  0  0
2    0  1  0  0  1  1  1  1  1  1  1  1
3    0  0  0  1  0  1  0  0  1  1  1  1
4    0  1  0  1  0  0  0  1  1  1  1  1
..  .. .. .. .. .. .. .. .. .. .. .. ..
995  0  1  1  0  1  1  0  0  1  0  0  0
996  1  1  1  0  0  0  1  0  1  1  0  1
997  1  1  0  1  0  0  0  0  0  1  0  1
998  0  1  1  0  0  1  0  0  0  0  0  1
999  0  0  1  0  1  1  0  0  0  1  1  1

[1000 rows x 12 columns]

In [110]:
out = out.astype(int)

In [111]:
sum(out[0])

521

In [125]:
gamma, epsilon = "", ""

In [126]:
range(len(out.columns))

range(0, 12)

In [127]:
for j in range(len(out.columns)):
    totalOnes = sum(out[j])
    if totalOnes > 500:
        gamma = gamma + "1"
        epsilon = epsilon + "0"
    else:
        gamma = gamma + "0"
        epsilon = epsilon + "1"

In [128]:
gamma2 = int(gamma,2)

In [129]:
gamma

'110000111111'

In [130]:
epsilon2 = int(epsilon,2)

In [131]:
gamma2 * epsilon2

3009600

In [226]:
out2 = out

In [227]:
while len(out3) > 1:
    totalOnes = sum(out3[j])
    if totalOnes > len(out3)/2:
        out3 = out3[out3[j] == 1]
        j += 1
    elif totalOnes == len(out3)/2:
        out3 = out3[out3[j] == 1]
        j += 1
    else:
        out3 = out3[out3[j] == 0]
        j += 1

In [228]:
oxygen = ""

In [229]:
for i in range(len(out2.columns)):
    stringed = str(out2.loc[280,i])
    oxygen = oxygen + stringed

In [230]:
oxygen

'111101100011'

In [231]:
oxygen2 = int(oxygen,2)

In [232]:
out3 = out

In [233]:
j = 0

In [234]:
while len(out3) > 1:
    totalOnes = sum(out3[j])
    if totalOnes < len(out3)/2:
        out3 = out3[out3[j] == 1]
        j += 1
    elif totalOnes == len(out3)/2:
        out3 = out3[out3[j] == 0]
        j += 1
    else:
        out3 = out3[out3[j] == 0]
        j += 1

In [236]:
out3

     0  1  2  3  4  5  6  7  8  9  10  11
779  0  1  1  0  1  1  1  0  0  0   1   0

In [235]:
co2 = ""

In [237]:
for i in range(len(out3.columns)):
    stringed = str(out3.loc[779,i])
    co2 = co2 + stringed

In [238]:
co22 = int(co2,2)

In [239]:
co22 * oxygen2

6940518